{
  "filePath": "Readme.md",
  "summary": "<summary> <purpose>This codebase provides a set of utility scripts for analyzing, visualizing, and summarizing the structure and contents of a software project. These tools are designed to assist developers and AI systems in better understanding and navigating the codebase.</purpose> <key_components> - captureCodebase.ts: Captures a snapshot of the codebase, respecting include/exclude patterns, and outputs the matched file contents to paste.txt. - diff.ts: Generates Git diffs for code review and documentation, capturing staged changes and including whitespace-ignored diffs. - getStructure.ts: Creates a directory structure map with file token counts, providing a hierarchical directory tree output and copying an LLM-friendly prompt to the clipboard. - rag.ts: Generates AI-powered file summaries using the Claude 3 Haiku model, with summary caching, metadata tracking, and configurable file extensions. </key_components> <dependencies> The scripts in this codebase rely on the following external dependencies: - Node.js runtime - Anthropic API key for the rag.ts script </dependencies> <unique_characteristics> - Configurable file inclusion/exclusion patterns for codebase capture - Token estimation for directory structure analysis - Summary caching and metadata tracking in rag.ts - Error handling for file system and API operations </unique_characteristics> <methods> - captureCodebase - diffFiles - getDirectoryStructure - generateSummaries - validateAPIKey - getFileHash - writeJSONFile - readJSONFile </methods> <exports if any> The scripts in this codebase do not export any functions or modules. They are designed to be run as standalone utilities. </exports if any> <any other information that you think an llm looking at a summary of all files in the repo would need to know> The codebase provides a set of tools that can be used to gain a better understanding of a software project's structure and contents. These tools can be particularly useful for AI systems that need to interact with or analyze the codebase, as they provide a standardized way to capture, visualize, and summarize the project's files and directories. </any other information...> </summary>",
  "lastUpdated": "2025-01-30T19:11:33.275Z",
  "fileHash": "23f71b3122824951b12881d84431c10b"
}