{
  "filePath": "src\\utils\\patterns\\ignorePatterns.ts",
  "summary": "<summary>   <purpose>The ignorePatterns.ts file provides default and configurable ignore patterns and file extensions for use in file/directory filtering operations, particularly in the context of code analysis and processing tools.</purpose>   <key_components>     - DEFAULT_IGNORE_PATTERNS: a Set of default ignore patterns (e.g. node_modules, dist, coverage)     - DEFAULT_INCLUDE_EXTENSIONS: a Set of default file extensions to include (e.g. .ts, .js, .json)     - IgnoreOptions: an interface defining configuration options for ignore patterns and include extensions     - createIgnorePatterns: a function that creates a configured set of ignore patterns based on the provided IgnoreOptions     - createIncludeExtensions: a function that creates a configured set of include extensions based on the provided IgnoreOptions     - shouldIgnorePath: a function that checks if a given path should be ignored based on the configured ignore patterns     - shouldIncludeFile: a function that checks if a given file should be included based on its extension and the configured include extensions   </key_components>   <dependencies>     None   </dependencies>   <unique_characteristics>     - Provides a centralized and configurable mechanism for managing ignore patterns and include extensions     - Supports extending or replacing default patterns/extensions     - Includes utility functions for checking if a path or file should be ignored/included   </unique_characteristics>   <methods>     - createIgnorePatterns     - createIncludeExtensions     - shouldIgnorePath     - shouldIncludeFile   </methods>   <exports if any>     - DEFAULT_IGNORE_PATTERNS     - DEFAULT_INCLUDE_EXTENSIONS     - IgnoreOptions     - createIgnorePatterns     - createIncludeExtensions     - shouldIgnorePath     - shouldIncludeFile   </exports if any> </summary>",
  "lastUpdated": "2025-01-31T23:14:53.000Z",
  "fileHash": "3e2c61cadf3698b03a600d8e305c275f"
}